Program z2;
const 
  words:array[1..36] of string[20]=
          ('один','два','три','четыре','пять','шесть','семь','восемь','девять',
           'десять','двадцать','тридцать','сорок','пятьдесят','шестьдесят','семьдесят','восемьдесят','девяносто',
           'сто','двести','триста','четыреста','пятьсот','шестьсот','семьсот','восемьсот','девятьсот',
           'одиннадцать','двенадцать','тринадцать','четырнадцать','пятнадцать','шестнадцать','семнадцать','восемнадцать','девятнадцать');
  number:array[1..36] of integer=
          (1,2,3,4,5,6,7,8,9,
           10,20,30,40,50,60,70,80,90,
           100,200,300,400,500,600,700,800,900,
           11,12,13,14,15,16,17,18,19);
  
var
  s,s2:string;
  x,n,i:integer;
  
  f1,f2 : text;
begin
  assign(f1,'input.txt');
  reset(f1);
  assign(f2,'output.txt');
  rewrite(f2);

  read(f1,s);  
  x:=0;
  while s<>'' do
    begin
      n:=pos(' ',s);
      if n=0
         then n:=length(s)
         else n:=n-1;
      s2:=copy(s,1,n);
      for i:=1 to 36 do
        if words[i]=s2
           then begin
                  x:=x+number[i];
                  break;
                end;
      Delete(s,1,n+1);          
    end;
  
  write(f2,x);
  
  close(f1);
  close(f2);
end.